SET NAMES UTF8;
DROP DATABASE IF EXISTS app;
CREATE DATABASE app CHARSET=UTF8;
USE app;


/** 用户信息 **/
CREATE TABLE app_user(
    uid INT PRIMARY KEY AUTO_INCREMENT,
    uname VARCHAR(32),
    upwd VARCHAR(32),
    avatar VARCHAR(128)
);


/*宝可梦编号,名字,图片地址,属性地址*/
CREATE TABLE pokemon(
    pid VARCHAR(10),
    pname VARCHAR(20) NOT NULL,
    purl VARCHAR(10) NOT NULL ,
    pattr VARCHAR(10) NOT NULL 
);


/*电影栏轮播图图片*/
CREATE TABLE carousel(
    cid INT,
    cimg  VARCHAR(20) NOT NULL
);

/*向pokemon表中插入数据*/
INSERT INTO pokemon (pname,pid,purl,pattr) VALUES 
("妙蛙种子","001","001.png","1.png"),("妙蛙草","002","002.png","2.png"),("妙蛙花","003","003.png","3.png"),("小火龙","004","004.png","4.png"),("火恐龙","005","005.png","5.png"),("喷火龙","006","006.png","6.png"),("杰尼龟","007","007.png","7.png"),("卡咪龟","008","008.png","8.png"),("水箭龟","009","009.png","9.png"),("绿毛虫","010","010.png","10.png"),("铁甲蛹","011","011.png","11.png"),("巴大蝶","012","012.png","12.png"),("独角虫","013","013.png","13.png"),("铁壳蛹","014","014.png","14.png"),("大针蜂","015","015.png","15.png"),("波波","016","016.png","16.png"),("比比鸟","017","017.png","17.png"),("大比鸟","018","018.png","18.png"),("小拉达","019","019.png","19.png"),("拉达","020","020.png","20.png"),("烈雀","021","021.png","21.png"),("大嘴雀","022","022.png","22.png"),("阿柏蛇","023","023.png","23.png"),("阿柏怪","024","024.png","24.png"),("皮卡丘","025","025.png","25.png"),("雷丘","026","026.png","26.png"),("穿山鼠","027","027.png","27.png"),("穿山王","028","028.png","28.png"),("尼多兰","029","029.png","29.png"),("尼多娜","030","030.png","30.png"),("尼多后","031","031.png","31.png"),("尼多朗","032","032.png","32.png"),("尼多力诺","033","033.png","33.png"),("尼多王","034","034.png","34.png"),("皮皮","035","035.png","35.png"),("皮可西","036","036.png","36.png"),("六尾","037","037.png","37.png"),("九尾","038","038.png","38.png"),("胖丁","039","039.png","39.png"),("胖可丁","040","040.png","40.png"),("超音蝠","041","041.png","41.png"),("大嘴蝠","042","042.png","42.png"),("走路草","043","043.png","43.png"),("臭臭花","044","044.png","44.png"),("霸王花","045","045.png","45.png"),("派拉斯","046","046.png","46.png"),("派拉斯特","047","047.png","47.png"),("毛球","048","048.png","48.png"),("摩鲁蛾","049","049.png","49.png"),("地鼠","050","050.png","50.png"),("三地鼠","051","051.png","51.png"),("喵喵","052","052.png","52.png"),("猫老大","053","053.png","53.png"),("可达鸭","054","054.png","54.png"),("哥达鸭","055","055.png","55.png"),("猴怪","056","056.png","56.png"),("火暴猴","057","057.png","57.png"),("卡蒂狗","058","058.png","58.png"),("风速狗","059","059.png","59.png"),("蚊香蝌蚪","060","060.png","60.png"),("蚊香君","061","061.png","61.png"),("蚊香泳士","062","062.png","62.png"),("凯西","063","063.png","63.png"),("勇基拉","064","064.png","64.png"),("胡地","065","065.png","65.png"),("腕力","066","066.png","66.png"),("豪力","067","067.png","67.png"),("怪力","068","068.png","68.png"),("喇叭芽","069","069.png","69.png"),("口呆花","070","070.png","70.png"),("大食花","071","071.png","71.png"),("玛瑙水母","072","072.png","72.png"),("毒刺水母","073","073.png","73.png"),("小拳石","074","074.png","74.png"),("隆隆石","075","075.png","75.png"),("隆隆岩","076","076.png","76.png"),("小火马","077","077.png","77.png"),("烈焰马","078","078.png","78.png"),("呆呆兽","079","079.png","79.png"),("呆壳兽","080","080.png","80.png"),("小磁怪","081","081.png","81.png"),("三合一磁怪","082","082.png","82.png"),("大葱鸭","083","083.png","83.png"),("嘟嘟","084","084.png","84.png"),("嘟嘟利","085","085.png","85.png"),("小海狮","086","086.png","86.png"),("白海狮","087","087.png","87.png"),("臭泥","088","088.png","88.png"),("臭臭泥","089","089.png","89.png"),("大舌贝","090","090.png","90.png"),("刺甲贝","091","091.png","91.png"),("鬼斯","092","092.png","92.png"),("鬼斯通","093","093.png","93.png"),("耿鬼","094","094.png","94.png"),("大岩蛇","095","095.png","95.png"),("催眠貘","096","096.png","96.png"),("引梦貘人","097","097.png","97.png"),("大钳蟹","098","098.png","98.png"),("巨钳蟹","099","099.png","99.png"),("霹雳电球","100","100.png","100.png"),("顽皮雷弹","101","101.png","101.png"),("蛋蛋","102","102.png","102.png"),("椰蛋树","103","103.png","103.png"),("卡拉卡拉","104","104.png","104.png"),("嘎啦嘎啦","105","105.png","105.png"),("飞腿郎","106","106.png","106.png"),("快拳郎","107","107.png","107.png"),("大舌头","108","108.png","108.png"),("瓦斯弹","109","109.png","109.png"),("双弹瓦斯","110","110.png","110.png"),("独角犀牛","111","111.png","111.png"),("钻角犀兽","112","112.png","112.png"),("吉利蛋","113","113.png","113.png"),("蔓藤怪","114","114.png","114.png"),("袋兽","115","115.png","115.png"),("墨海马","116","116.png","116.png"),("海刺龙","117","117.png","117.png"),("角金鱼","118","118.png","118.png"),("金鱼王","119","119.png","119.png"),("海星星","120","120.png","120.png"),("宝石海星","121","121.png","121.png"),("魔墙人偶","122","122.png","122.png"),("飞天螳螂","123","123.png","123.png"),("迷唇姐","124","124.png","124.png"),("电击兽","125","125.png","125.png"),("鸭嘴火兽","126","126.png","126.png"),("凯罗斯","127","127.png","127.png"),("肯泰罗","128","128.png","128.png"),("鲤鱼王","129","129.png","129.png"),("暴鲤龙","130","130.png","130.png"),("拉普拉斯","131","131.png","131.png"),("百变怪","132","132.png","132.png"),("伊布","133","133.png","133.png"),("水伊布","134","134.png","134.png"),("雷伊布","135","135.png","135.png"),("火伊布","136","136.png","136.png"),("多边兽","137","137.png","137.png"),("菊石兽","138","138.png","138.png"),("多刺菊石兽","139","139.png","139.png"),("化石盔","140","140.png","140.png"),("镰刀盔","141","141.png","141.png"),("化石翼龙","142","142.png","142.png"),("卡比兽","143","143.png","143.png"),("急冻鸟","144","144.png","144.png"),("闪电鸟","145","145.png","145.png"),("火焰鸟","146","146.png","146.png"),("迷你龙","147","147.png","147.png"),("哈克龙","148","148.png","148.png"),("快龙","149","149.png","149.png"),("超梦","150","150.png","150.png"),("梦幻","151","151.png","151.png"),("美录坦","152","152.png","152.png"),("美录梅坦","153","153.png","153.png");


/*向carousel表中插入数据*/
INSERT INTO carousel (cid,cimg) VALUES 
(1,"story_01.jpg"),
(2,"story_02.jpg"),
(3,"story_03.jpg"),
(4,"story_04.jpg");

/*创建movies表*/
CREATE TABLE movies(
    mid INT PRIMARY KEY AUTO_INCREMENT,
    mtitle VARCHAR(30) NOT NULL,
    mimg VARCHAR(20) NOT NULL,
    mcontent TEXT(300) NOT NULL
);

/* 向movies表中插入数据 */
INSERT INTO movies (mid,mtitle,mimg,mcontent) VALUES
(1,"剧场版宝可梦 我们的故事","001.jpg","《宝可梦》电影版 迈出全新一步——继20週年纪念电影《剧场版宝可梦 就决定是你了！》大热登场之后，才华洋溢的年轻导演加上製作团队，带来全新的《宝可梦》电影 —《剧场版宝可梦 我们的故事》！即将与大家一起展开前所未见的冒险，踏出全新的一步！"),(2,"剧场版宝可梦 就决定是你了！","002.jpg","你知道两人是如何相遇的吗？小智和皮卡丘现在是最强的伙伴，但是他们的第一次见面实际上却很糟！虽然笨拙的小智想成为皮卡丘的朋友，皮卡丘却听不进小智说的话。这两人如何成为伙伴?一天他们从真新镇出发踏上旅程。那天他们发誓要一起见到凤王。「有一天我们一定要去见他！」在凤王的彩虹之翼指引下，两人开始了他们的冒险！"),(3,"光环的超魔神 胡帕","003.jpg","当小智、皮卡丘和他们的朋友们抵达海边的一个沙漠城市时，他们遇到了幻之宝可梦胡帕，他有能力通过Magic Ring召唤事物 - 包括人和宝可梦。在一个可怕的事件发生后，他们了解了一个勇敢英雄的故事，很久以前这位英雄就阻止了一个可怕宝可梦的肆虐。现在，已经尘封多年的威胁又将再次降临！小智可以帮助他的新朋友克服黑暗吗？还是一个危险的秘密会转变成一个传奇？"),(4,"剧破坏之茧与蒂安希","004.jpg","地底的钻石矿国住着许多小碎钻，他们的领导者是幻之宝可梦蒂安希。维持土地的圣洁钻石开始分崩离析，但蒂安希却没有强到足以创造一颗新的。寻求传说的宝可梦哲尔尼亚斯帮助的途中，蒂安希遇到了一群想要控制自己生产钻石能力的盗贼，过程中唤醒了茧中的传说宝可梦伊裴尔塔尔！小智和他的朋友们可以帮助蒂安希发现他真正的力量，并阻止伊裴尔塔尔的肆虐、拯救钻石矿国吗？"),(5,"神速的盖诺赛克特 超梦觉醒","005.jpg","当大麻烦威胁到大城市时，小智、皮卡丘和他们的朋友就要阻止它！喧嚣的大城市似乎是五只巨大的宝可梦盖诺赛克特一个完美的新家园。这些幻之宝可梦的到来很快成为一个问题，他们的巢穴威胁著城市的电力供应，并且不断的攻击任何接近他的人。最重要的是，他们引起了传说的宝可梦超梦的注意。超梦同情他们，因为他们的基因也遭到人为的篡改。这群盖诺赛克特的领导者，被称为赤红盖诺赛克特，并不相信超梦，他们的对决迅速失控！小智和朋友们可以在城市被摧毁之前阻止这两个强大的宝可梦吗？"),(6,"酋雷姆VS圣剑士 凯路迪欧","006.jpg","小智和皮卡丘，以及他们的朋友艾莉丝和天桐，正搭乘火车前往旅程的下一个地点。小智在火车上发现了一只从未见过的宝可梦受伤了。他试图从传说的龙宝可梦酋雷姆的攻击中拯救这只宝可梦。小智和其他人几乎无法摆脱酋雷姆狂暴的攻击，随著尘埃落定，他们把注意力转向受伤的宝可梦。他们的新朋友竟然是幻之宝可梦凯路迪欧，他的任务是拯救他的朋友勾帕路翁、代拉基翁和毕力吉翁脱离酋雷姆的掌握。这几只宝可梦是被称为圣剑士的传说宝可梦。但是酋雷姆的肆虐还没有结束，他正从莱希拉姆和捷克罗姆汲取力量，变成焰白酋雷姆或闇黑酋雷姆，使其攻击更加强大！为什么酋雷姆以如此无情的愤怒攻击小智和他的朋友？他们将如何克服危机？为了保护朋友，为了发现真正的力量和纯正的勇气，为了保持与小智及其伙伴的羁绊，凯路迪欧隐藏的力量觉醒了。"),(7,"比克提尼与黑英雄 捷克罗姆/比克提尼与白英雄 莱希拉姆","007.jpg","在他们穿过合众地区的旅途中，小智和他的朋友们艾莉丝和天桐抵达艾茵多奥克，这个地区围绕著一座名为大地之剑的城堡而建。三名训练家来镇上参加一年一度的对战比赛，小智想藉著幻之宝可梦比克提尼的一些意想不到的帮助来赢得胜利！比克提尼却与这个地方有特别的羁绊。很久以前，这座城堡就可以观望大地之民王国，比克提尼和国王之间的合作关系保护了住在那裡的人们。但是这个王国从此消失了，留下了强大的遗迹和古老的宝可梦。大地之民的后裔德雷多打算以人造细胞卵恢复失落的王国。他的追求将他带到了遥远荒芜的沙漠，他说服了传说的宝可梦莱希拉姆加入他！德雷多打算用陷阱捕捉比克提尼，并使用其力量。随著这一计划的进行，整个艾茵多奥克都面临灾难！小智的理想是否可以说服传说的宝可梦捷克罗姆帮助他阻止德雷多？他们能拯救比克提尼吗？宝可梦历史上最伟大的冒险即将来临！"),(8,"幻影的霸者 索罗亚克","008.jpg","这是今年最值得期待的赛事，数以百计的人群涌入王冠市观看令人激动的比赛。小智、皮卡丘和他的朋友们遇到了一个从未见过的神秘宝可梦。但是三个传说的宝可梦雷公、炎帝及水君突然出现并开始在街上暴走。小智和他的朋友们以及新宝可梦索罗亚将揭开隐藏在强大势力背后的秘密。王冠市正在发生什么奇怪而危险的事呢？为什么时拉比在消失了二十年之后突然回来呢？为什么强大的索罗亚克在城裡发怒呢？寻找这些答案的路上充满危险与不确定，小智和他的朋友们可以找到足够的勇气、力量和友谊来解答谜团并及时拯救王冠市吗？"),(9,"阿尔宙斯 超克的时空","009.jpg","三部曲电影的最后一部，揭露传说的阿尔宙斯是在宝可梦世界断层的中心。首先帝牙卢卡和帕路奇亚之间史诗般的对战在时空的夹缝中开了一个洞。因此，反转世界唯一的守护者骑拉帝纳必须採取行动来保护其家园和宝可梦世界岌岌可危的平衡。现在，米季纳镇是行动的核心。这个城镇历史悠久并与强大的阿尔宙斯有关。阿尔宙斯将自己的力量，也就是生命宝玉 赋予城镇居民，但却遭到背叛！小智和他的朋友们与新伙伴希娜在帝牙卢卡的帮助下穿越了时空，希望可以纠正镇上祖先的错误，让世界不至于在阿尔宙斯的愤怒之下瓦解。他们能修复过去的错误吗？过去到底发生了什么事？希娜的祖先真的背叛了阿尔宙斯吗？前面两部电影隐藏的祕密即将被揭露，敬请观赏三部曲的精彩大结局！"),(10,"骑拉帝纳与冰空的花束 谢米","010.jpg","骑拉帝纳是生活在反转世界的唯一宝可梦，反转世界是一个鲜为人知的领域。当帕路奇亚和帝牙卢卡扰乱时间和空间时，骑拉帝纳大怒而进入反转世界与之对战，但这场衝突却被一个小小的感谢宝可梦谢米打破！离开反转世界后，谢米遇见小智和他的朋友们，他使用心灵沟通寻求帮助，他才能返回葛拉西蒂亚的花束与其他谢米团圆。小智和他的朋友们同意协助谢米后不久，他们被拖入反转世界，并遇到了正在研究这个神秘领域的穆玄。他们并不知道穆玄的前助手杰洛试图利用骑拉帝纳的力量来统治反转世界，即使这意味著摧毁现实世界！我们的英雄们和他们的宝可梦是否可以摧毁杰洛的邪恶计划，保护两个世界呢？骑拉帝纳能否解决与帝牙卢卡的分歧？小智和他的朋友们又会了解谢米的特殊之处为何吗？"),(11,"宝可梦巡护员与苍海的王子 玛纳霏","011.jpg","有一个传说，有一个由水之民创造的海之神殿，里面藏著海之王冠。没有人见过海之王冠，也很少有人知道神殿的故事，除了一些曾去过宝可梦世界的水之民。宝可梦巡护员杰克从一名叫幻影的贪婪海盗手中救了玛纳霏的蛋后，一切起了变化。幻影决心要抢夺海之王冠，但他需要玛纳霏才能到达那裡。为了抢先一步，杰克将需要得到水之民的帮助。在遇到水之民后，小智、小遥和朋友们就被卷入这场行动。小遥甚至和神秘的玛纳霏有了一个非常特殊的羁绊，连幻影也望尘莫及。他们必须一起抢在幻影之前找到海之神殿，解开连接玛纳霏和海之神殿的秘密！"),(12,"梦幻与波导的勇者 路卡利欧","012.jpg","几百年前，波导骑士亚朗爵士崇高的牺牲拯救了欧鲁德朗及其人民。从那一天起，人们一直以年度庆典来纪念他的事蹟。当然，小智并不是一个历史迷，他更有兴趣的是宝可梦对战。他在对战中胜利后，被要求扮成伟大的波导的勇者，亚朗的重要性更得以显现，尤其是当路卡利欧从Aaron's staff中出现时。亚朗对这个长时间休眠的宝可梦来说并不是英雄，路卡利欧唯一记得的是背叛他的主人！距上次对战后过了数百年，路卡利欧被要求再次成为英雄。梦幻将皮卡丘和喵喵送到Tree of Life，一个只有路卡利欧才知道如何去的地方。路卡利欧是否可以放弃对人类的不信任，并和小智和他的朋友们合作？"),(13,"裂空的访问者 代欧奇希斯","013.jpg","高科技的拉鲁斯市是一个相当令人印象深刻的游览景点，也是作为宝可梦对战一个非常令人印象深刻的地方！小智直奔他们著名的对战塔，但当他的对战伙伴变成一个叫小超的胆小男孩时，情况并不太乐观。由于童年事件造成的恐惧，小超害怕所有的宝可梦，即使是像皮卡丘一样可爱的宝可梦！当代欧奇希斯出现并控制了这个城市，造成了更多恐惧。他关闭了机器并俘虏了每个人。这个情形激怒了传说的烈空坐，他决定无论如何要将这个侵略者从他的领域中驱逐。与此同时，小智、小超和朋友们或许会身限其中，但他们当然不会害怕战斗。"),(14,"七夜的许愿星 基拉祈","014.jpg","千年彗星即将再次在天空中崭露头角，据说是为所有在天空中看到它的人们献上祝福。当然，小智和朋友们对Millennium Festival也很感兴趣，特别是参加了伟大的巴特勒的魔术表演时。 更有趣的是巴特勒拥有的神秘的茧，小胜听到有声音从裡面传出来！当基拉祈从沉睡中醒来的时候，小胜有了一个新的朋友，可悲的是，他们拥有彼此的时间只有在千年彗星出现的短短几天。小胜渴望能够把自己的时间用在他的新朋友身上，但是伟大的巴特勒对自己的计划却不是很支持。他想要恢复传说的固拉多，而基拉祈也许能够实现这个愿望。小胜、小智、小遥和小刚是否能阻止巴特勒并在固拉多再次出现破坏一切时拯救基拉祈？"),(15,"水都的守护神 拉帝亚斯与拉帝欧斯","015.jpg","每年奥多马雷都会沿著运河街道举行一场特殊的宝可梦水上竞赛，而这一次，小智和小霞是最大的竞争对手！即使没有获胜，小智仍然在一个神秘女孩的心中树立了自己的特殊地位，他从两个粗暴女人手中救出她。但她并非一般女孩而是伪装后的传说的宝可梦拉蒂亚斯！小智有机会一窥拉帝欧斯和拉帝亚斯的秘密世界，但是这个世界很快就了个来自过去的女人桑娜和莉安所威胁。她们不只想要抓到传说的宝可梦也想得到一种叫做心之水滴的神秘宝石。这些元素结合起来可以让她们控制一台可以防止危险的强大机器。但是，当机器发生故障时，不仅使得拉帝欧斯和拉帝亚斯陷于危险之中，还使整个奥多马雷全城发生危险！"),(16,"时拉比 穿梭时空的相遇","016.jpg","总有人想控制和捕猎稀有的宝可梦，有些人会保护这些特殊的宝可梦免受邪恶势力的攻击。四十年前，当时拉比正在逃离一个恶毒的猎人时，发生了一件事，一位名叫雪成的年轻训练家前来救援。他们消失了，从此成为市民讲述的另一个奇妙的传说。在现代，小智和朋友们到了森林裡，雪成和时拉比的事蹟原本只被当成一个故事，但在那个传说中的男孩和宝可梦再次出现时，他们发现了真相！虽然两人都从四十年前的悲惨经历中恢复，但情况并没有好转，仍然有人想捕猎时拉比！敌人叫做比夏斯，而他的计划可能是最残酷的。他装备了黑暗球，能使任何被捕猎到的宝可梦变得顺从以及邪恶。小智、雪成、小霞和小刚能否承受被洗脑的时拉比之力，并将其恢复到真正的自我呢？"),(17,"梦幻的宝可梦 洛奇亚爆诞","017.jpg","小智和他的朋友们旅程来到橙子群岛，但即使这个看起来安静的岛屿，散布在关都地区偏远南部的水域，也有其神秘、冒险和传说的宝可梦！吉尔露太当然知道这一点，所以他现在在不同岛屿间旅行，捕猎三只传说的鸟类，火焰鸟、急冻鸟、闪电鸟。但是，即使拥有这三只鸟的力量，充其量也只是最大奖的垫脚石，这个最大奖就是海之守护者洛奇亚！当然当小智抵达目的地时，他完全不知道这件事。岛民对他也有很大但不险恶的计画，他们希望小智参加一个仪式，收集来自不同岛屿的三个元素球。当世界各地的天气失控时，这个任务变得更加重要，因为捕猎传说中的鸟类已经使环境失去了平衡。在洛奇亚的帮助下，小智可以成为众望所归的「被选中的人」吗？"),(18,"超梦的逆袭","018.jpg","这是首次亮相的超梦的冒险故事，超梦是通过生物工程制造的宝可梦，它是由所有最稀有的宝可梦之一梦幻的DNA创造的。从实验室逃离后，超梦决心证明自己的优势。它吸引了许多有天赋的训练家进入一场前所未有的宝可梦对战，当然，小智和他的朋友们也乐于接受挑战！当超梦揭露他的计画竟然是统治时，小智的心情由兴奋转变为恐惧和愤怒。超梦计画创造强大的复制英雄宝可梦，然后他就可以将宝可梦和训练家之间的不平衡消弭。尽管小智反对，超梦拒绝相信宝可梦和人可以成为朋友。但面对年轻训练家的决心和忠诚时，超梦可能不得不重新考虑......特别是对抗神秘的梦幻的力量时！");

/* 创建pokemon_index表格,保存首页相关文字内容*/
CREATE TABLE pokemon_index(
    intr TEXT(200) NOT NULL,
    animate TEXT(1000) NOT NULL,
    game  TEXT(1000) NOT NULL,
    differences TEXT(1000) NOT NULL
);

INSERT INTO pokemon_index(intr,animate,game,differences) VALUES
('<img src="https://s1.52poke.wiki/wiki/thumb/3/3a/%E5%AE%9D%E5%8F%AF%E6%A2%A6%E7%89%B9%E5%88%AB%E7%AF%87%E5%95%86%E6%A0%87_%E5%90%89%E7%BE%8E.png/90px-%E5%AE%9D%E5%8F%AF%E6%A2%A6%E7%89%B9%E5%88%AB%E7%AF%87%E5%95%86%E6%A0%87_%E5%90%89%E7%BE%8E.png"/><span style="font-size: 18px;color: #add8e6">电视动画《宝可梦》（ポケモン），改编自宝可梦系列游戏。是由汤山邦彦等执导，园田英树、大桥志吉等编剧，松本梨香、大谷育江等配音的同名长篇电视动画系列。动画的日文版根据游戏原作版本，可按照时间顺序划分为七部：《宝可梦》、《宝可梦：超世代》、《宝可梦：钻石与珍珠》、《宝可梦：超级愿望》、《宝可梦XY》、《宝可梦：太阳&月亮》和《宝可梦：旅途》。除电视动画系列外，宝可梦系列作品同样包括一些旁支作品：描述非主角一行的角色的故事的周刊宝可梦广播电台、宝可梦星期天、PokémonSmash!等。2019年8月1日起，The Pokémon Company（总公司：东京都港区六本木；代表取缔役社长：石原恒和）将逐步变更“精灵宝可梦”的名称为“宝可梦”。同时，也制作发布了“宝可梦”的标记设计。</span>','<img src="https://s1.52poke.wiki/wiki/thumb/2/2c/%E5%AF%B6%E5%8F%AF%E5%A4%A2_%E7%AC%AC7%E4%BD%9C_%E6%97%A5%E6%9C%AC%E5%9C%96%E6%A8%99.png/300px-%E5%AF%B6%E5%8F%AF%E5%A4%A2_%E7%AC%AC7%E4%BD%9C_%E6%97%A5%E6%9C%AC%E5%9C%96%E6%A8%99.png"/><hr/><p>宝可梦动画（日文︰アニメポケットモンスター，英文︰Pokémon anime）是指从1997年开始在电视上播放的宝可梦动画片，以及与之相关的电影、短篇、外传和动画特别篇等以宝可梦为主要角色之一的动画。主动画系列的主要剧情讲述立志成为宝可梦大师的小智，和他的搭档皮卡丘一起踏上旅途，在旅途中遇到了许多伙伴和种种事件。目前为止动画已经播放了7个主要系列，剧情分别对应了《宝可梦》系列游戏的内容，其中动画首作中还另有动画原创的橘子群岛剧情，超级愿望篇中也另有杰可罗拉群岛的原创剧情。截至2021年3月末，宝可梦动画目前已经在183个国家和地区播放。除了主动画系列以外也有一些与之不同世界观的特别动画，一般场合所说的宝可梦动画没有特别说明的情况下所指的都是主动画系列。</p><p>宝可梦动画于1997年4月1日在日本开始播放，以《红／绿》和《金／银》的游戏为蓝本进行过程为动画故事主要剧情。于2002年11月21日起，随着《红宝石／蓝宝石》的发售，动画推出宝可梦超世代系列。又于在2006年9月28日，随着《钻石／珍珠》的发售而开始播出宝可梦钻石＆珍珠系列，于2010年9月23日开始则是配合《黑／白》的发售，开始播放宝可梦 超级愿望系列，在2012年6月21日配合《黑２／白２》更换标题为“超级愿望第2季”，2013年1月17日追加“N篇”的后缀，又于2013年4月25日追加“杰可罗拉大冒险篇”的后缀。2013年10月17日，随著《Ｘ／Ｙ》的发售，开始播放宝可梦XY篇。于2016年11月17日起，以《太阳／月亮》蓝本的宝可梦太阳＆月亮系列开播。于2019年11月17起，宝可梦旅途系列开播。在日本以外的地区，宝可梦动画以每季约52集为单位销售播放版权。宝可梦动画原本在每周二晚6点半于东京电视台播放，在多边兽事件之后，从1997年12月16日开始到1998年4月15日停播，复播改为每周四晚7点播出。动画于2012年迎来了播放15周年的纪念，成为现在东京电视网所播放的动画系列中最长寿的动画节目。2016年4月，播放时间调整到每周四晚6点55分播出；2018年10月7日，调整到每周日晚6点播出；2020年10月9日，调整到每周五晚6点55分播出。动画最早使用赛璐珞胶片拍摄制作，在2002年开始转为数码制作，之前的作品也全部数码化。在超世代后期已经开始大量使用CG技术制作宝可梦招式的特效。在日本开始全面施行数字电视播放之后，宝可梦动画仍以标准清晰度进行制作（画面比4：3）。从2009年4月2日开始，转为高清晰度制作（画面比16：9）。另外在东京电视台的隐藏字幕中，招式的名字使用汉字来显示</p><el-divider></el-divider>','<img src="https://cn.portal-pokemon.com/assets_c/2020/06/20200526_147_logo%28CN%29%20-thumb-624xauto-14731.png"/ width="20%"><hr/><p>宝可梦游戏主要包括覆盖多种掌上游戏机、家用游戏机和街机平台的电子游戏、手机平台的应用程序，等等。所有游戏都基于宝可梦这一虚拟生物。宝可梦游戏主要是指游戏机（掌机、家机和街机）、手机和电脑平台上发行的游戏和衍生应用。广义的宝可梦游戏还可包括如宝可梦集换式卡牌游戏等桌面游戏。根据发售的平台，可以分为电子游戏（Video Game）、手机应用程序（App）和街机游戏。其中，电子游戏则包括基于第一款宝可梦游戏《红／绿》的《宝可梦》系列，以及旁支系列游戏；而旁支系列游戏又可根据世界观和主题划分为各种系列、与其它游戏合作的游戏、辅助游戏的各种应用类软件等。其中，又以《宝可梦》系列游戏更广为人知，大部分衍生作品都是基于《宝可梦》系列游戏创作的。其相关衍生产品涵盖了动画、漫画、集换式卡牌游戏、实体产品等多个方面，现在已经成为了全球流行的游戏系列。自Pokémon GO之后，官方也推出了更多手机应用程序。根据游戏涵盖的宝可梦数量、游戏平台和发布时间，宝可梦游戏（主要是电子游戏和卡牌游戏）在爱好者间多被划分为不同的世代，目前最新的世代是第八世代。</p><el-divider></el-divider>','<img src="https://s1.52poke.wiki/wiki/e/ef/%E6%9E%81%E5%B7%A8%E5%8C%96_Sprite.png"/><p>动画和游戏的区别</p><img src="https://s1.52poke.wiki/wiki/e/ef/%E6%9E%81%E5%B7%A8%E5%8C%96_Sprite.png"/><hr/><ul><li>1.初期出现了大量的上色错误或设定错误。如宝可梦中心大对决！中的绿色波波，与传说的鸟宝可梦并列传说的宝可梦的风速狗。</li><li>2.因为动画的错误，即使招式效果、变化招式或属性相克而导致无法造成伤害的招式，在动画中有时也会造成伤害，例如在深灰市的决斗！中，小智的皮卡丘用十万伏特击败了拥有地面属性的小拳石。后来这样的错误日益得到修正。</li><li>3.宝可梦在早期能够同时学会4个以上的招式，例如勇次的快龙就在对战中使用了10个以上的招式。而在第一部之后的动画中，除了宝可梦与生俱来的能力不计入4个招式内（库库伊博士的炽焰咆哮虎身上的火焰腰带），很少再出现同时期招式超过四个的情况。</li><li>4.收服宝可梦的途径并不只有宝可梦对战一种方式，也可以通过交流和感化。有的宝可梦甚至会主动加入队伍，例如：小智的煤炭龟、赫拉克罗斯。</li><li>5.招式的威力并不固定，可以由使用的宝可梦视情况来自主调整力道，例如在蜈蚣王发飙！救出牙牙!!中花椰猴曾经使用威力减弱后的种子机关枪和日光束陪牙牙练习。</li><li>6.招式的命中率和游戏不同，并没有固定的数据，即使是游戏中一定会命中的招式在动画中也可能被躲开，例如：燕返、波导弹、电击波等，即使是威力强大且一定会命中的Ｚ招式也不例外。</li><li>7.可能会出现特殊和物理混为一谈的情况，比如只能够抵挡特殊招式的光墙有时候会用来抵挡物理招式。</li><li>8.宝可梦使出招式有可能不会出现追加效果，例如劲敌决战！小智版甲贺忍蛙VS超级蜥蜴王!!中音波龙受到翔太的暴飞龙的龙尾的攻击，却未退场。</li><li> 9.宝可梦有时候承受招式时不但不会受到伤害，反而会吸收对方的招式以便增加自己的力量，例如在灵兽形态合力进击！合众最大的危机!!中皮卡丘吸收了雷电云的打雷，使自己的电属性招式威力增加，并用巨大化的电球摧毁神殿及打败火箭队。</li><li>10.宝可梦可随时随地使用招式，并不局限于对战上，也不局限于游戏中对战外可使用的招式。宝可梦可以灵活运用招式方便做事情，会产生具有现实意义的效果。例如藤鞭是草属性宝可梦们手臂一样的存在；吐丝中的丝线可以帮助宝可梦们活动，并且捆缚住对方。</li><li>11.宝可梦无需掌握秘传学习器招式，就可以利用自身的能力协助训练家行动。比如拉普拉斯，一般来说即使没有学会冲浪也可以载人，但在游戏中必须先让它学会冲浪。</li><li>12.在动画中宝可梦的一些道具可以抵消招式。例如，小智的水水獭可以用扇贝贝来反射的电属性招式。</li><li>13.和游戏中只能使用招式不同，动画版中会出现诸如把对方“扔出去”、让宝可梦“躲开”这样的命令，或利用对方的攻势进行反击等情况发生。例如在再度遭遇火焰鸡!!与叶越的战斗!!中叶越的火焰鸡只使用脚部把月桂叶的飞叶快刀踢下来，甚至使用手部抓住藤鞭并把月桂叶拉过来，以便进行近距离攻击。此外，宝可梦也可只用身体部分而不用招式进行攻击或挡下招式。</li><li>14.能参加空中对战的宝可梦可能与游戏不同，比如在空中对战!?摔角鹰人对烈箭鹰!!中，小智的小箭雀和摔角鹰人都能参加空中对战，而游戏中不能。</li><li>15.宝可梦的速度表现不一定符合游戏的速度种族值，可能受到宝可梦的体形或者身体构造影响，比如在草苗龟、树林龟…以及土台龟！中小智的草苗龟因为进化成树林龟体重大大增加而导致行动变得迟缓。</li><li>16.宝可梦可以在对战中进化。例如在宝可圆环！天空大决战!!中小智的姆克鸟进化成姆克鹰。</li><li>17.宝可梦的进化方式可能不同，最著名的就是呆呆兽确实是被大舌贝咬住尾巴后合体进化成呆壳兽，或头戴王者之证后被大舌贝咬住王者之证合体进化成呆呆王，尽管游戏图鉴中亦如此说明，但实际是升级或者交换进化。</li><li>18.宝可梦可以主动忍耐克制进化，比如小光的波加曼。</li><li>19.最初的伙伴并不限制在游戏中的几种宝可梦，也有根据风俗或特别情况给出别的宝可梦。</li><li>20.收集到8枚徽章后不能直接与四天王交战，而是参加宝可梦联盟大会与其他拥有徽章的训练家对战，类似于运动会，每个大会都会有自己的圣火传递和圣火点燃仪式。宝可梦联盟大会是进行宝可梦对战的选拔淘汰赛，类似于竞技场模式，还有类似于选手村的设定。如系列首作就有“石英联盟的石英大会”、“城都联盟的白银大会”等等。</li><li>21.当成为宝可梦联盟大会的冠军后才能挑战四天王。</li><li>22.有时会出现游戏中没有的特殊宝可梦，最著名的就是水晶大岩蛇。</li><li>23.经常加入游戏中没有的原创剧情与地点，例如宝可梦中的橘子群岛和宝可梦超级愿望中的杰可罗拉群岛。</li><li>24.各地方的道馆不止游戏中出现的，有的训练家还持有游戏中没有的徽章。除了橘子联盟，小智挑战的都是游戏中出现的道馆。</li><li>25.道具的效果可能与游戏不同。比如在对决！巨大鲶鱼王与钓鱼高手！中，铃村的大师球被鲶鱼王吃掉而并非捕捉成功。</li><li>26.训练家可在放出宝可梦时下指令，方便宝可梦直接使用招式。</li></ul>');

/*创建movies详情表*/
CREATE TABLE movies_details(
    id INT PRIMARY KEY AUTO_INCREMENT,
    p_name VARCHAR(200),
    p_intr TEXT(1000),
    small_img VARCHAR(200),
    big_img VARCHAR(200),
    story_img VARCHAR(100),
    title VARCHAR(30),
    article TEXT(1000)
);

/*往movies_details表中掺入数据*/
INSERT INTO movies_details(id,p_name,p_intr,small_img,big_img,story_img,title,article) VALUES
(1,"婕拉奥拉丨洛奇亚丨小智丨拉茹果丨利莎丨托里托丨卡嘎其丨翡翠丨利酷丨欧里巴市长","幻之宝可梦，传说居于风来城深山，手脚的肉球能释出大量电流，能以电一般的速度在空中高速移动。丨传说的宝可梦，相传会在「风节」的最后一天现身，为城市送上「恩惠之风」。丨梦想成为世界第一的宝可梦大师，和拍档皮卡丘继续冒险之旅，希望遇上未曾见过的宝可梦。丨风来城市长的女儿，性格随和、有教养，与幻之宝可梦捷拉奥拉，好像有某种关係...丨宝可梦新手训练家，被受伤的弟弟所託，收服伊布去参加「风节」。丨不擅长与人相处的宝可梦研究家，为了发表研究而参加「风节」。缺乏自信，常常要吉利蛋安慰。丨吹牛吹到停不下来的吹牛大叔，带着他最疼爱的姪女一起去「风节」玩，因为某种缘故，树才怪非常喜欢他，他不停跟人说：「这城市里似乎有超稀有的宝可梦！」丨居于风来城，非常讨厌宝可梦的婆婆，因为过去发生的某些事而极力迴避宝可梦，但小锯鳄和其他宝可梦，都爱缠住她。丨利莎的弟弟，非常喜欢宝可梦，因为脚伤而留院中。丨风来城市长，拉茹果的父亲，责任感强及严格，为了令「风节」顺利举行而非常忙碌。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","剧场版宝可梦 我们的故事","《宝可梦》电影版 迈出全新一步——继20週年纪念电影《剧场版宝可梦 就决定是你了！》大热登场之后，才华洋溢的年轻导演加上製作团队，带来全新的《宝可梦》电影 —《剧场版宝可梦 我们的故事》！即将与大家一起展开前所未见的冒险，踏出全新的一步！在人类与风共同生活的城市 —「风来城」，每年会举行一年一度的风节」。在「风节」的最后一天，传说的宝可梦洛奇亚会现身，为人类送上「恩惠之风」。这是人类与洛奇亚多年以来的约定。小智和皮卡丘偶然到达风来城参加「风节」，遇上了宝可梦新手训练家利莎、喜欢吹牛的吹牛大叔卡嘎其、没有自信的懦弱研究家托里托、讨厌宝可梦的怪婆婆翡翠，还有独自伫足森林的神祕少女拉茹果。他们5人各有各的烦恼，以至无法和自己的宝可梦拍档更进一步，作出改变。但随着大家的相遇，命运的齿轮开始转动了…人类和洛奇亚的约定，能够如期发生吗？幻之宝可梦捷拉奥拉的真面目又是什么？现在，人类和宝可梦的友谊，即将令奇迹发生……"),(2,"小智丨宗次丨诚子丨克罗斯丨梵爷丨幻之宝可梦「玛夏多」丨传说的宝可梦「凤王」","一个立志成为宝可梦大师的男孩。他很莽撞但是真诚。丨一个立志成为宝可梦博士的训练家。小智和皮卡丘在旅途中遇见他。丨一个充满活力、有点男性化的训练家。小智和皮卡丘在旅途中遇见她。看起来她很享受冒险，但实际上...丨一个相信力量就是一切的男孩，目标是成为最强大的训练家。丨追踪凤王很久的研究员。是「凤王乃我人生」的作者。丨当小智和皮卡丘继续寻找凤王的旅程时，一个神秘的宝可梦出现在了小智的影子中，似乎与虹色之羽互相呼应。他是敌人还是朋友？丨他会在拥有纯洁之心的训练家面前现身，展现闪耀明亮的虹色之翼。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","剧场版宝可梦 就决定是你了！","你知道两人是如何相遇的吗？小智和皮卡丘现在是最强的伙伴，但是他们的第一次见面实际上却很糟！虽然笨拙的小智想成为皮卡丘的朋友，皮卡丘却听不进小智说的话。这两人如何成为伙伴?一天他们从真新镇出发踏上旅程。那天他们发誓要一起见到凤王。「有一天我们一定要去见他！」在凤王的彩虹之翼指引下，两人开始了他们的冒险！"),
(3,"胡帕（惩戒的样子）丨胡帕（解放的样子）丨阿尔宙斯丨洛奇亚丨拉帝亚斯丨拉帝欧斯丨盖欧卡丨固拉多丨黑色烈空坐丨帝牙卢卡丨帝牙卢卡和帕路奇亚丨雷吉奇卡斯丨骑拉帝纳丨萊希拉姆","幻之宝可梦，喜欢恶作剧和甜甜圈。他可以从一个mysterious ring「捞捞」中製造出各种物体。丨胡帕的真正型态。因100年前的肆虐，他被封进了惩戒之壶。丨传说的宝可梦，据说创造了这个世界。丨传说的宝可梦，是胡帕「捞捞」的受害者。他们和小智和他的朋友们一起战斗。丨传说的宝可梦，100年前是胡帕「捞捞」的受害者。据说盖欧卡是海的化身，固拉多是土地的化身。丨传说的宝可梦，100年前是胡帕「捞捞」的受害者。据说盖欧卡是海的化身，固拉多是土地的化身。丨传说的宝可梦，住在地球上方的臭氧层中。他的颜色与一般的烈空坐不同。丨据说帝牙卢卡是控制时间的神。丨而帕路奇亚是控制空间的神。丨传说的宝可梦，100年前是胡帕「捞捞」的受害者。他在城镇中肆虐。丨传说的宝可梦，生活在反转世界。丨莱希拉姆捷克罗姆是传说的宝可梦，在合众地区流传下来的英雄传说。丨莱希拉姆捷克罗姆是传说的宝可梦，在合众地区流传下来的英雄传说。丨一个强大的龙宝可梦，结合了莱希拉姆和捷克罗姆的力量。他会从身体产生极冷的空气。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg丨small_13.jpg丨small_14.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png丨big_13.png丨big_14.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","光环的超魔神 胡帕","当小智、皮卡丘和他们的朋友们抵达海边的一个沙漠城市时，他们遇到了幻之宝可梦胡帕，他有能力通过Magic Ring召唤事物 - 包括人和宝可梦。在一个可怕的事件发生后，他们了解了一个勇敢英雄的故事，很久以前这位英雄就阻止了一个可怕宝可梦的肆虐。现在，已经尘封多年的威胁又将再次降临！小智可以帮助他的新朋友克服黑暗吗？还是一个危险的秘密会转变成一个传奇？"),
(4,"蒂安希丨小碎钻丨哲尔尼亚斯丨伊裴尔塔尔丨阿尔盖斯·史提尔丨弥莉丝·史提尔丨忍者·莱尔特 丨玛丽伶·芙烈姆丨小智丨莎莉娜丨希特隆丨火箭队","钻石矿国的公主。为了与哲尔尼亚斯见面，借用他的力量製造圣洁钻石，也就是钻石矿国能量的来源，她开始了旅程。丨他在钻石矿国和平地生活着，却与蒂安希一起踏上了旅程。丨被称为生命宝可梦，据说可以给予人和宝可梦生命。传说中这是唯一可与伊裴尔塔尔匹敌的宝可梦。丨造成灾害的宝可梦，夺走了卡洛斯地区的许多生命。摧毁了一切后，沉睡在破坏之茧里。丨弥莉丝的父亲。他拥有一个大型的飞艇，喜欢巧克力。丨阿尔盖斯的女儿。她拯救了被火箭队绑架的蒂安希。她的伙伴是布里卡隆。丨一个忍者小偷，脸上藏着一个面具，目标是蒂安希。他的伙伴是甲贺忍蛙。丨一位美丽的小偷，目标是蒂安希。她的伙伴是妖火红狐。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨生活在卡洛斯地区的女孩，喜欢时尚。似乎之前就见过小智！？丨一位男性道馆馆主。他是一个很好的发明家，他的背包里装满了他的骄傲和喜悦，长尾怪手臂。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","破坏之茧与蒂安希","地底的钻石矿国住着许多小碎钻，他们的领导者是幻之宝可梦蒂安希。维持土地的圣洁钻石开始分崩离析，但蒂安希却没有强到足以创造一颗新的。寻求传说的宝可梦哲尔尼亚斯帮助的途中，蒂安希遇到了一群想要控制自己生产钻石能力的盗贼，过程中唤醒了茧中的传说宝可梦伊裴尔塔尔！小智和他的朋友们可以帮助蒂安希发现他真正的力量，并阻止伊裴尔塔尔的肆虐、拯救钻石矿国吗？"),
(5,"超梦丨盖诺赛克特丨勾魂眼丨小智丨艾莉丝丨天桐丨火箭队丨艾利克","由改造梦幻基因而产生的宝可梦。他的战斗能力已被改造到最高。丨远古时代就存在的宝可梦。他们背部的电池置有不同的卡带。赤红盖诺赛克特是被选出的领导者，比一般的盖诺赛克特更强且更快。丨生活在宝可梦山庄的宝可梦。他与小智成为朋友。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨一个活跃且充满活力的女孩。与小智和他的朋友们一起旅行寻求成为龙之大师。她的伙伴宝可梦是牙牙。她有一个习惯，就是说“孩子...”丨三曜道馆的馆主，也是和经过认证的宝可梦酒侍，分析了训练家和宝可梦之间的密切关係。他多元的兴趣包括地铁，钓鱼和电影。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨一个在宝可梦山庄工作的男孩。他带着小智和他的朋友们参观宝可梦山庄。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","神速的盖诺赛克特 超梦觉醒","当大麻烦威胁到大城市时，小智、皮卡丘和他们的朋友就要阻止它！喧嚣的大城市似乎是五只巨大的宝可梦盖诺赛克特一个完美的新家园。这些幻之宝可梦的到来很快成为一个问题，他们的巢穴威胁着城市的电力供应，并且不断的攻击任何接近他的人。最重要的是，他们引起了传说的宝可梦超梦的注意。超梦同情他们，因为他们的基因也遭到人为的篡改。这群盖诺赛克特的领导者，被称为赤红盖诺赛克特，并不相信超梦，他们的对决迅速失控！小智和朋友们可以在城市被摧毁之前阻止这两个强大的宝可梦吗？"),
(6,"酋雷姆丨凯路迪欧丨勾帕路翁丨代拉基翁丨毕力吉翁丨小智丨艾莉丝丨天桐","强大的龙属性宝可梦，可将莱希拉姆和捷克罗姆的力量结合。与莱希拉姆和捷克罗姆同时出生，拥有最大的力量。他可以转变成焰白酋雷姆和暗黑酋雷姆。他会从身体产生极冷的空气。丨据说是圣剣士继承人的宝可梦。他接受勾帕路翁、代拉基翁和毕力吉翁的训练。一旦凯路迪欧成长并唤醒真正的力量，他将转变成其一般型态并对决酋雷姆。丨被称为圣剑士之一的宝可梦。是被推举的领导者。为了保护宝可梦的世界，他们在旅途中训练自己。有冷静和集中的态度，身体和心脏皆由钢铁组成。丨被称为圣剑士之一的宝可梦。为了保护宝可梦的世界，他们在旅途中训练自己。无人能敌他的力量和冲击。丨被称为圣剑士之一的宝可梦。为了保护宝可梦的世界，他们在旅途中训练自己。速度和正义是他的最高原则。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨一个活跃且充满活力的女孩。与小智和他的朋友们一起旅行寻求成为龙之大师。她的伙伴宝可梦是牙牙。她有一个习惯，就是说“孩子...”丨三曜道馆的馆主，也是和经过认证的宝可梦酒侍，分析了训练家和宝可梦之间的密切关係。他多元的兴趣包括地铁，钓鱼和电影。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","酋雷姆VS圣剑士 凯路迪欧","小智和皮卡丘，以及他们的朋友艾莉丝和天桐，正搭乘火车前往旅程的下一个地点。小智在火车上发现了一隻从未见过的宝可梦受伤了。他试图从传说的龙宝可梦酋雷姆的攻击中拯救这隻宝可梦。小智和其他人几乎无法摆脱酋雷姆狂暴的攻击，随着尘埃落定，他们把注意力转向受伤的宝可梦。他们的新朋友竟然是幻之宝可梦凯路迪欧，他的任务是拯救他的朋友勾帕路翁、代拉基翁和毕力吉翁脱离酋雷姆的掌握。这几隻宝可梦是被称为圣剑士的传说宝可梦。但是酋雷姆的肆虐还没有结束，他正从莱希拉姆和捷克罗姆汲取力量，变成焰白酋雷姆或暗黑酋雷姆，使其攻击更加强大！为什麽酋雷姆以如此无情的愤怒攻击小智和他的朋友？他们将如何克服危机？为了保护朋友，为了发现真正的力量和纯正的勇气，为了保持与小智及其伙伴的羁绊，凯路迪欧隐藏的力量觉醒了。"),
(7,"比克提尼丨捷克罗姆丨萊希拉姆丨泥偶巨人丨三首恶龙丨萊希拉姆丨哥德小姐丨小智丨艾莉丝丨天桐丨火箭队丨德雷多丨卡莉塔","小智和他的朋友们在艾茵多奥克遇见的幻之宝可梦。他很胆小，通常会躲起来，但据说他会暗中给他所喜欢的人及宝可梦神秘的力量。喜欢马卡龙。丨德雷多的姐姐。生活在艾茵多奥克。她参加了丰收节战斗比赛。她使用三首恶龙。丨传说的宝可梦。当他遇见全心追求理想的人时就会出现。丨传说的宝可梦。当他遇见全心追求真理的人时就会出现。丨姜塔的宝可梦。他在姜塔经营的纪念品商店帮忙。丨卡莉塔的宝可梦他会在丰收节战斗比赛中扮演主角吗？丨传说的宝可梦。当他遇见全心追求真理的人时就会出现。丨德雷多的伙伴宝可梦。他与德雷多一起在冰原上旅行。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨一个活跃且充满活力的女孩。与小智和他的朋友们一起旅行寻求成为龙之大师。她的伙伴宝可梦是牙牙。她有一个习惯，就是说“孩子...”丨三曜道馆的馆主，也是和经过认证的宝可梦酒侍，分析了训练家和宝可梦之间的密切关係。他多元的兴趣包括地铁，钓鱼和电影。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨大地之民的后裔。希望恢复大地之民王国，他正在寻找散佈在每个地区的大地之民。丨德雷多的姐姐。生活在艾茵多奥克。她参加了丰收节战斗比赛。她使用三首恶龙。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg丨small_13.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png丨big_13.png","story_01.jpg丨story_02.jpg丨story_03.jpg","比克提尼与黑英雄 捷克罗姆/比克提尼与白英雄 莱希拉姆","在他们穿过合众地区的旅途中，小智和他的朋友们艾莉丝和天桐抵达艾茵多奥克，这个地区围绕着一座名为大地之剑的城堡而建。三名训练家来镇上参加一年一度的对战比赛，小智想借着幻之宝可梦比克提尼的一些意想不到的帮助来赢得胜利！比克提尼却与这个地方有特别的羁绊。很久以前，这座城堡就可以观望大地之民王国，比克提尼和国王之间的合作关係保护了住在那里的人们。但是这个王国从此消失了，留下了强大的遗迹和古老的宝可梦。大地之民的后裔德雷多打算以人造细胞卵恢复失落的王国。他的追求将他带到了遥远荒芜的沙漠，他说服了传说的宝可梦莱希拉姆加入他！德雷多打算用陷阱捕捉比克提尼，并使用其力量。随着这一计划的进行，整个艾茵多奥克都面临灾难！小智的理想是否可以说服传说的宝可梦捷克罗姆帮助他阻止德雷多？他们能拯救比克提尼吗？宝可梦历史上最伟大的冒险即将来临！"),
(8,"索罗克亚丨索罗亚丨雷公丨炎帝丨水君丨时拉比丨小智丨小光丨小刚丨火箭队丨寇泰丨库鲁特","有能力制造幻像的宝可梦。被寇泰所控制而攻击王冠市。丨擅长变化成其他宝可梦的宝可梦。他可以使用心灵感应与人沟通。丨传说的宝可梦，据说会跟雷声一起降临。雷公的电击会危及王冠市吗？丨传说的宝可梦，据说是在新火山形成时诞生的。炎帝的火焰会烧毁王冠市吗？丨传说的宝可梦，据说是重生的北风。水君的水柱会破坏王冠城吗？丨有能力穿越时间的宝可梦，只有在和平时期才会出现。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨双叶镇的一名新宝可梦训练家。母亲是一位杰出的宝可梦协调训练家，受此影响，她的梦想就是出现在宝可梦华丽大赛中。丨关都地区尼比道馆前馆主。他对宝可梦非常了解，而且是一个很好的厨师。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨一个被称为「能看到未来」的神秘人物。他使用索罗亚克实现他的邪恶阴谋，让王冠城陷入混乱。丨王冠市的一名新闻记者。他正在接近寇泰的秘密。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","幻影的霸者 索罗亚克","这是今年最值得期待的赛事，数以百计的人群涌入王冠市观看令人激动的比赛。小智、皮卡丘和他的朋友们遇到了一个从未见过的神秘宝可梦。但是三个传说的宝可梦雷公、炎帝及水君突然出现并开始在街上暴走。小智和他的朋友们以及新宝可梦索罗亚将揭开隐藏在强大势力背后的秘密。王冠市正在发生什么奇怪而危险的事呢？为什么时拉比在消失了二十年之后突然回来呢？为什么强大的索罗亚克在城里发怒呢？寻找这些答案的路上充满危险与不确定，小智和他的朋友们可以找到足够的勇气、力量和友谊来解答谜团并及时拯救王冠市吗？"),
(9,"阿尔宙斯丨帝牙卢卡丨帕路奇亚丨骑拉帝纳丨刺刺耳皮丘丨小锯鳄丨菊草叶丨火球鼠丨希娜丨达摩斯丨奇辛","被称为神的宝可梦，据说是他创造了世界。因被人背叛而感到愤怒，出现在米季纳要对人类施以审判。丨被称为神的宝可梦，可以控制时间。他保护米季纳免受阿尔宙斯的攻击，并将小智和他的朋友们送到过去。丨被称为神的宝可梦，可以控制空间。保护米季纳免受阿尔宙斯的攻击。丨住在反转世界的宝可梦。保护米季纳免受阿尔宙斯的攻击。丨独特的耳毛是她的特征。一个有点精力充沛且早熟的女孩。她可以自由进出神殿，并救出皮卡丘和小智。丨在米季纳与皮卡丘和伙伴们同为重要角色。丨在米季纳与皮卡丘和伙伴们同为重要角色。丨在米季纳与皮卡丘和伙伴们同为重要角色。丨废墟的守护者。她可以读取宝可梦的想法。丨数千年前，他拯救了阿尔宙斯的生命，并获得了生命宝玉。丨达摩斯的助手。席多蓝恩和青铜钟是其跟随者。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","阿尔宙斯 超克的时空","三部曲电影的最后一部，揭露传说的阿尔宙斯是在宝可梦世界断层的中心。首先帝牙卢卡和帕路奇亚之间史诗般的对战在时空的夹缝中开了一个洞。因此，反转世界唯一的守护者骑拉帝纳必须採取行动来保护其家园和宝可梦世界岌岌可危的平衡。现在，米季纳镇是行动的核心。这个城镇历史悠久并与强大的阿尔宙斯有关。阿尔宙斯将自己的力量，也就是生命宝玉 赋予城镇居民，但却遭到背叛！小智和他的朋友们与新伙伴希娜在帝牙卢卡的帮助下穿越了时空，希望可以纠正镇上祖先的错误，让世界不至于在阿尔宙斯的愤怒之下瓦解。他们能修复过去的错误吗？过去到底发生了什么事？希娜的祖先真的背叛了阿尔宙斯吗？前面两部电影隐藏的祕密即将被揭露，敬请观赏三部曲的精彩大结局！"),
(10,"谢米丨骑拉帝纳丨雷吉奇卡斯丨象牙猪丨盾甲龙丨小智丨小光丨小刚丨火箭队丨杰洛丨穆玄","具有「花之传递」特徵的宝可梦。他和小智一起寻找花园。可以进行形态变化。丨生活在反转世界的宝可梦。因反转世界受到污染而大怒，于是追踪帝牙卢卡。可以进行形态变化。丨在冰川深处沉眠的宝可梦。因冰川危机而苏醒，并试图阻止冰川崩塌。丨生活在冰川附近的宝可梦。成群结队地跟随着雷吉奇卡斯出现。丨研究反转世界的穆玄的伙伴宝可梦。他努力帮助穆玄和小智。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨双叶镇的一名新宝可梦训练家。母亲是一位杰出的宝可梦协调训练家，受此影响，她的梦想就是出现在宝可梦华丽大赛中。丨关都地区尼比道馆前馆主。他对宝可梦非常了解，而且是一个很好的厨师。他目前朝成为一名宝可梦培育家迈进。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨控制高科技母舰的神秘年轻人。他试图利用骑拉帝纳的力量来控制世界。丨研究反转世界的杰出学者。他花了五年时间研究反转世界。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","骑拉帝纳与冰空的花束 谢米","骑拉帝纳是生活在反转世界的唯一宝可梦，反转世界是一个鲜为人知的领域。当帕路奇亚和帝牙卢卡扰乱时间和空间时，骑拉帝纳大怒而进入反转世界与之对战，但这场衝突却被一个小小的感谢宝可梦谢米打破！离开反转世界后，谢米遇见小智和他的朋友们，他使用心灵沟通寻求帮助，他才能返回葛拉西蒂亚的花束与其他谢米团圆。小智和他的朋友们同意协助谢米后不久，他们被拖入反转世界，并遇到了正在研究这个神秘领域的穆玄。他们并不知道穆玄的前助手杰洛试图利用骑拉帝纳的力量来统治反转世界，即使这意味着摧毁现实世界！我们的英雄们和他们的宝可梦是否可以摧毁杰洛的邪恶计划，保护两个世界呢？骑拉帝纳能否解决与帝牙卢卡的分歧？小智和他的朋友们又会了解谢米的特殊之处为何吗？"),
(11,"玛纳霏丨泳圈鼬丨聒噪鸟丨小球飞鱼丨小智丨小遥丨小胜丨小刚丨火箭队丨杰克丨广美丨幻影队长丨小码头马戏团","幻之宝可梦。当他破蛋而出时误将小遥当成妈妈，能凭借本能到达海之神殿。丨小码头马戏团的吉祥物，并能将脖子周围的领巾部份膨胀以漂浮在水面。丨海盗幻影的宝可梦，善于模仿人类语言。丨被杰克捕猎，并将杰克送到了海之神殿。丨一个立志成为宝可梦大师的男孩，他和他的伙伴皮卡丘一起踏上旅程。丨小胜的姐姐，她决定和小智以及朋友们一起成为一名顶尖宝可梦协调训练家。丨小遥的弟弟。他梦想着成为一名像父亲千里一样的道馆馆主。丨尼比道馆前馆主，出生于关都地区。他对宝可梦非常了解，而且是一个很好的厨师。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨和宝可梦协力保护环境的宝可梦巡护员。和小智以及他的朋友们合力对抗海盗幻影。丨水之民的孙子。是小码头马戏团的水上明星，使用水属性宝可梦进行精彩的表演。丨实力雄厚的海盗头目，使用潜艇之类的高科技机器来抓住玛纳霏的蛋，同时追逐小智和他的朋友们。丨成员为广美的家人，他们同时也是海之民的子孙。他们想借助小智以及他的朋友们帮助将玛纳霏送回亚克夏。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg丨small_13.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png丨big_13.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","宝可梦巡护员与苍海的王子 玛纳霏","有一个传说，有一个由水之民创造的海之神殿，里面藏着海之王冠。没有人见过海之王冠，也很少有人知道神殿的故事，除了一些曾去过宝可梦世界的水之民。宝可梦巡护员杰克从一名叫幻影的贪婪海盗手中救了玛纳霏的蛋后，一切起了变化。幻影决心要抢夺海之王冠，但他需要玛纳霏才能到达那里。为了抢先一步，杰克将需要得到水之民的帮助。在遇到水之民后，小智、小遥和朋友们就被捲入这场行动。小遥甚至和神秘的玛纳霏有了一个非常特殊的羁绊，连幻影也望尘莫及。他们必须一起抢在幻影之前找到海之神殿，解开连接玛纳霏和海之神殿的秘密！"),
(12,"路卡利欧丨梦幻丨玛狃拉丨魔尼尼丨盆才怪丨雷吉洛克、雷吉艾斯、雷吉斯奇鲁丨小智丨小遥丨小刚丨火箭队丨亚朗丨琳恩丨艾琳丨琪朵·夏玛兹","曾经服侍过波导的勇者亚朗的宝可梦。路卡利欧出现在小智和他的朋友们面前，在此之前他被封印在石头装饰Aaron's Staff里好几百年。丨幻之宝可梦，极少有人见过。丨琪朵·夏玛兹的伙伴，在欧鲁德朗城的宝可梦对战中对战皮卡丘。丨艾琳女王身旁经常会出现的宝可梦。喜欢模仿在女王周围的人。丨小智和他的朋友们在旅途中碰到的宝可梦，与他们一起旅行。他经常流假眼泪来警告周遭的人。丨保护“世界初始之树”的宝可梦，会激烈地攻击任何试图靠近树的人。丨一个立志成为宝可梦大师的男孩，他和他的伙伴皮卡丘一起踏上旅程。丨小胜的姐姐，她决定和小智以及朋友们一起成为一名顶尖宝可梦协调训练家。丨尼比道馆前馆主，出生于关都地区。他对宝可梦非常了解，而且是一个很好的厨师。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨现在他被称为“波导的勇者”，几百年前，在他服侍琳恩女王的期间使用波导平息了冲突并与路卡利欧并肩战斗时。丨艾琳女王的祖先，也是波导的勇者亚朗服侍的对象。丨琳恩女王的孙女，欧鲁德朗城的拥有者。她受到市民的敬爱和尊敬，因为她是一位既善良又有尊严的君王。丨儘管她被提升为预科生，但却已经是世界级的女冒险家，有大无畏的精神到处寻找刺激。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg丨small_13.jpg丨small_14.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png丨big_13.png丨big_14.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","梦幻与波导的勇者 路卡利欧","几百年前，波导骑士亚朗爵士崇高的牺牲拯救了欧鲁德朗及其人民。从那一天起，人们一直以年度庆典来纪念他的事迹。当然，小智并不是一个历史迷，他更有兴趣的是宝可梦对战。他在对战中胜利后，被要求扮成伟大的波导的勇者，亚朗的重要性更得以显现，尤其是当路卡利欧从Aaron's staff中出现时。亚朗对这个长时间休眠的宝可梦来说并不是英雄，路卡利欧唯一记得的是背叛他的主人！距上次对战后过了数百年，路卡利欧被要求再次成为英雄。梦幻将皮卡丘和喵喵送到Tree of Life，一个只有路卡利欧才知道如何去的地方。路卡利欧是否可以放弃对人类的不信任，并和小智和他的朋友们合作？"),
(13,"代欧奇希斯丨烈空坐丨小卡比兽丨正电拍拍和负电拍拍丨小智丨小遥丨小胜丨小刚丨火箭队丨小超丨伦多博士","据说是来自太空的宝可梦，能够改变形态以适应环境。从频繁的激烈对战中可看出他极其敌对烈空坐。丨传说的宝可梦，生活在臭氧层，会在代欧奇希斯出现时从天而降。丨食欲旺盛的宝可梦，可以吃掉任何东西，吃光了小刚为小超和其他朋友们做的食物。丨生活在拉鲁斯市的恶作剧宝可梦，喜欢玩高科技垃圾桶。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨小胜的姐姐，她决定和小智以及朋友们一起成为一名顶尖宝可梦协调训练家。丨小遥的弟弟。他梦想着成为一名像父亲千里一样的道馆馆主。丨尼比道馆前馆主，出生于关都地区。他对宝可梦非常了解，而且是一个很好的厨师。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨自从四年前在伦多博士的冰场研究中发现某些事件以来，只有教授的儿子变得性格内向，并且与宝可梦互动不好。在拉鲁斯市交跟小智和皮卡丘交上朋友后，他就和他们一起旅行。丨一位担任拉鲁斯市高科技研究机构主任的科学家。自从他四年前在冰场进行研究时遇到陨石掉落时，他遇见了代欧奇希斯，因此他对宝可梦的生态产生了浓厚的兴趣。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","裂空的访问者 代欧奇希斯","高科技的拉鲁斯市是一个相当令人印象深刻的游览景点，也是作为宝可梦对战一个非常令人印象深刻的地方！小智直奔他们著名的对战塔，但当他的对战伙伴变成一个叫小超的胆小男孩时，情况并不太乐观。由于童年事件造成的恐惧，小超害怕所有的宝可梦，即使是像皮卡丘一样可爱的宝可梦！当代欧奇希斯出现并控制了这个城市，造成了更多恐惧。他关闭了机器并俘虏了每个人。这个情形激怒了传说的烈空坐，他决定无论如何要将这个侵略者从他的领域中驱逐。与此同时，小智、小超和朋友们或许会身限其中，但他们当然不会害怕战斗。"),
(14,"基拉祈丨阿勃梭鲁丨沙漠蜻蜓丨怪物固拉多丨小智丨小遥丨小胜丨小刚丨火箭队丨巴特勒丨戴安","授予和传达人类愿望的宝可梦，每一千年甦醒一次，一次只有7天。虽然他通常隐藏在神秘的茧里，但是他反映了诚实和真诚的孩子愿望。丨在灾难发生时出现的宝可梦。丨在基拉祈的故乡法恩斯和小智一行一起英勇战斗。丨被巴特勒使用千年彗星的能量复活，但事实上与固拉多是完全不同的。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨小胜的姐姐，她决定和小智以及朋友们一起成为一名顶尖宝可梦协调训练家。丨小遥的弟弟。他梦想着成为一名像父亲千里一样的道馆馆主。丨尼比道馆前馆主，出生于关都地区。他对宝可梦非常了解，而且是一个很好的厨师。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨曾经是邪恶组织熔岩队中的科学家，研究传说的宝可梦固拉多的复苏，因过去实验的失败而被组织流放。他目前正与他的情人黛安一起，成为一个流浪魔术师伟大的巴特勒。丨巴特勒的童年朋友如今是他的情人，同时也是一个魔术师助手。她跟随巴特勒，对熔岩队怀有强烈的复仇心。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","七夜的许愿星 基拉祈","千年彗星即将再次在天空中崭露头角，据说是为所有在天空中看到它的人们献上祝福。当然，小智和朋友们对Millennium Festival也很感兴趣，特别是参加了伟大的巴特勒的魔术表演时。 更有趣的是巴特勒拥有的神秘的茧，小胜听到有声音从里面传出来！当基拉祈从沉睡中醒来的时候，小胜有了一个新的朋友，可悲的是，他们拥有彼此的时间只有在千年彗星出现的短短几天。小胜渴望能够把自己的时间用在他的新朋友身上，但是伟大的巴特勒对自己的计划却不是很支持。他想要恢复传说的固拉多，而基拉祈也许能够实现这个愿望。小胜、小智、小遥和小刚是否能阻止巴特勒并在固拉多再次出现破坏一切时拯救基拉祈？"),
(15,"拉帝亚斯丨拉帝欧斯丨化石翼龙丨镰刀盔丨小智丨小霞丨小刚丨火箭队丨卡侬丨本葛雷丨桑娜丨莉安丨罗西","传说的宝可梦，据说是奥多马雷的守护者。拉帝欧斯的妹妹，非常喜欢小智。当拉帝欧斯被俘虏时要求小智帮忙救出拉帝欧斯。丨拉帝亚斯的哥哥，和妹妹一起住在神秘花园。当受到心之水滴海啸以及古代机器攻击时，他奋力抵抗。丨最初是在大教堂地板上的化石，但是心之水滴的力量让他活了过来。在小智和朋友拯救拉帝欧斯时，化石翼龙攻击了他们。丨跟化石翼龙一样，被心之水滴的力量复活的宝可梦。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨身为家族4姐妹中最小的妹妹，小霞拥有不屈的个性，按照自己的步调做事。她开始了自己的旅程，成为了一名优秀的水属性宝可梦训练家。丨尼比道馆前馆主，出生于关都地区。他对宝可梦非常了解，而且是一个很好的厨师。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨本葛雷的孙女，与本葛雷一起保护秘密花园，喜欢画画。丨奥多马雷的一位gondola工匠，祖先曾是秘密花园的保护者。告诉小智和朋友关于心之水滴的秘密。丨海盗姐妹的姐姐，和莉安一起偷走本葛雷守护的心之水滴。她使用高科技机器穿越奥多马雷。丨海盗姊妹的妹妹，想要得知心之水滴的神秘力量并用它来重新启动她们的旧机器。丨在宝可梦水上竞赛时遇见小智和朋友们，并带他们乘上gondola游览奥多马雷。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg丨small_13.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png丨big_13.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","水都的守护神 拉帝亚斯与拉帝欧斯","每年奥多马雷都会沿着运河街道举行一场特殊的宝可梦水上竞赛，而这一次，小智和小霞是最大的竞争对手！即使没有获胜，小智仍然在一个神秘女孩的心中树立了自己的特殊地位，他从两个粗暴女人手中救出她。但她并非一般女孩而是伪装后的传说的宝可梦拉蒂亚斯！
小智有机会一窥拉帝欧斯和拉帝亚斯的秘密世界，但是这个世界很快就了个来自过去的女人桑娜和莉安所威胁。她们不只想要抓到传说的宝可梦也想得到一种叫做心之水滴的神秘宝石。这些元素结合起来可以让她们控制一台可以防止危险的强大机器。但是，当机器发生故障时，不仅使得拉帝欧斯和拉帝亚斯陷于危险之中，还使整个奥多马雷全城发生危险！"),
(16,"时拉比丨水君丨班基拉斯丨小智丨小霞丨小刚丨火箭队丨比夏斯丨雪成丨美久的祖母丨美久丨猎人丨","幻之宝可梦，被称为森林的保护者。在时拉比出现的地方，植物都会生长健壮。他还具有时空穿越的特殊能力。40年前，当时拉比被世界各地的宝可梦猎人捕猎时，碰巧遇见了雪成。丨传说的宝可梦，被称为北风的转世，具有净化污水的能力。他与小智和朋友合作拯救时拉比。丨被比夏斯用黑暗球擒获后，被以邪恶的力量唤醒并猛烈地攻击了小智和朋友。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨身为家族4姐妹中最小的妹妹，小霞拥有不屈的个性，按照自己的步调做事。她开始了自己的旅程，成为了一名优秀的水属性宝可梦训练家。丨尼比道馆前馆主，出生于关都地区。他对宝可梦非常了解，而且是一个很好的厨师。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨「火箭队」的高阶主管之一，试图通过捕猎时拉比征服世界。丨一个喜欢观察宝可梦的男孩。带着他的素描簿，在旅途中遇到了时拉比，并与时拉比穿越时空到了40年后的未来。丨一直守着果野村森林，小智和他的朋友们和比夏斯作战的时候、她有给他们援助。丨一位在森林里引导小智和他的朋友们的女孩。丨一名宝可梦猎人，40年前在Voice of the Forest中捕猎了时拉比。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","时拉比 穿梭时空的相遇","总有人想控制和捕猎稀有的宝可梦，有些人会保护这些特殊的宝可梦免受邪恶势力的攻击。四十年前，当时拉比正在逃离一个恶毒的猎人时，发生了一件事，一位名叫雪成的年轻训练家前来救援。他们消失了，从此成为市民讲述的另一个奇妙的传说。在现代，小智和朋友们到了森林里，雪成和时拉比的事蹟原本只被当成一个故事，但在那个传说中的男孩和宝可梦再次出现时，他们发现了真相！虽然两人都从四十年前的悲惨经历中恢复，但情况并没有好转，仍然有人想捕猎时拉比！敌人叫做比夏斯，而他的计划可能是最残酷的。他装备了黑暗球，能使任何被捕猎到的宝可梦变得顺从以及邪恶。小智、雪成、小霞和小刚能否承受被洗脑的时拉比之力，并将其恢复到真正的自我呢？"),
(17,"洛奇亚丨火焰鸟丨闪电鸟丨急冻鸟丨呆呆王丨小智丨小霞丨火箭队丨小建丨吉尔露太丨芙卢拉丨小优丨队长丨长老","幻之宝可梦，会在世界出现灾难的时候出现。生活在亚西亚岛附近的深海，也被称为水之伟大守护者。丨一种被称为火之神的特殊宝可梦，最先被吉尔露太补猎，导致自然平衡的破坏。丨被称为雷之神的特殊宝可梦，当火焰鸟不在的时候趁机入侵火岛并支配。丨被称为冰之神的特殊宝可梦。吉尔露太补猎火焰鸟和闪电鸟后，他将亚西亚岛的周围环境变成冰海。丨他保护亚西亚岛的祭坛，并关心世界面临的灾难。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨身为家族4姐妹中最小的妹妹，小霞拥有不屈的个性，按照自己的步调做事。她开始了自己的旅程，成为了一名优秀的水属性宝可梦训练家。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨一名具有优秀观察力和梦想的模范学生，梦想是阐明宝可梦的奥秘。丨一位从世界各地收集稀有物品的神秘收藏家。他拥有一个巨大的飞艇带着他旅行，并尝试把火焰鸟，闪电鸟，急冻鸟和洛奇亚加到他的收藏品之中。丨一个来自亚西亚岛的年轻女孩，她告诉了小智这个岛上的传说，也担心小智在踏上他的旅程时会被风浪包围。另外，她的陶笛隐藏著什么秘密？丨美乐蒂的姐姐，5年后与她的朋友，队长重新团聚。丨一个可靠的船长，能够在风浪海面航行，并允许小智和他的朋友上船前往亚西亚岛。丨根据岛屿的传说，他选择小智作为一名特殊的训练家。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg丨small_13.jpg丨small_14.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png丨big_13.png丨big_14.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","梦幻的宝可梦 洛奇亚爆诞","小智和他的朋友们旅程来到橙子群岛，但即使这个看起来安静的岛屿，散佈在关都地区偏远南部的水域，也有其神秘、冒险和传说的宝可梦！吉尔露太当然知道这一点，所以他现在在不同岛屿间旅行，捕猎三只传说的鸟类，火焰鸟、急冻鸟、闪电鸟。但是，即使拥有这三只鸟的力量，充其量也只是最大奖的垫脚石，这个最大奖就是海之守护者洛奇亚！
当然当小智抵达目的地时，他完全不知道这件事。岛民对他也有很大但不险恶的计画，他们希望小智参加一个仪式，收集来自不同岛屿的三个元素球。当世界各地的天气失控时，这个任务变得更加重要，因为捕猎传说中的鸟类已经使环境失去了平衡。在洛奇亚的帮助下，小智可以成为众望所归的「被选中的人」吗？"),
(18,"超梦丨梦幻丨快龙丨小智丨小霞丨小刚丨火箭队丨乔伊丨波佳丨空男丨海男丨教授","由人类使用梦幻的DNA所创造，是拥有巨大力量的最强宝可梦。丨幻之宝可梦，据说是世界上最稀有的宝可梦。丨替超梦传送邀请卡给全世界的训练家。丨一个立志成为宝可梦大师的男孩，他和他的皮卡丘一起踏上旅程。丨身为家族4姐妹中最小的妹妹，小霞拥有不屈的个性，按照自己的步调做事。她开始了自己的旅程，成为了一名优秀的水属性宝可梦训练家。丨尼比道馆前馆主，出生于关都地区。他对宝可梦非常了解，而且是一个很好的厨师。丨坂木率领的一个邪恶组织，目标是征服世界。成员武藏、小次郎和喵喵一直找机会收服小智的皮卡丘。丨被超梦绑架并洗脑，成为他的女僕。丨小智和朋友抵达的港口负责人。她热情地守护着所有的训练家。丨曾被邀请至宝可梦城的其中一位训练家，他骑着大比鸟穿越过岛屿。丨曾被邀请至宝可梦城的其中一位训练家，并使用暴鲤龙和超梦对战。丨创造超梦的科学家小组领导者。","small_01.jpg丨small_02.jpg丨small_03.jpg丨small_04.jpg丨small_05.jpg丨small_06.jpg丨small_07.jpg丨small_08.jpg丨small_09.jpg丨small_10.jpg丨small_11.jpg丨small_12.jpg","big_01.png丨big_02.png丨big_03.png丨big_04.png丨big_05.png丨big_06.png丨big_07.png丨big_08.png丨big_09.png丨big_10.png丨big_11.png丨big_12.png","story_01.jpg丨story_02.jpg丨story_03.jpg丨story_04.jpg","超梦的逆袭","这是首次亮相的超梦的冒险故事，超梦是通过生物工程制造的宝可梦，它是由所有最稀有的宝可梦之一梦幻的DNA创造的。从实验室逃离后，超梦决心证明自己的优势。它吸引了许多有天赋的训练家进入一场前所未有的宝可梦对战，当然，小智和他的朋友们也乐于接受挑战！当超梦揭露他的计画竟然是统治时，小智的心情由兴奋转变为恐惧和愤怒。超梦计画创造强大的复制英雄宝可梦，然后他就可以将宝可梦和训练家之间的不平衡消弭。尽管小智反对，超梦拒绝相信宝可梦和人可以成为朋友。但面对年轻训练家的决心和忠诚时，超梦可能不得不重新考虑......特别是对抗神秘的梦幻的力量时！");


CREATE TABLE pk_products(
    id INT PRIMARY KEY AUTO_INCREMENT,
    category VARCHAR(15),
    products_img VARCHAR(10),
    products_description VARCHAR(100),
    new_price INT(5),
    old_price INT(5)
);

INSERT INTO pk_products(id,category,products_img,products_description,new_price,old_price) VALUES
(1,"life","1.jpg","NIIMBOT精臣D110标签打印机 宝可梦定制款","99","199"),
(2,"toy","2.jpg","日本TAKARATOMY出品，皮卡丘危机一发！","199","249"),
(3,"life","3.jpg","三棵树BB漆宝可梦联名系列全新上市，以家人之名，与宝可梦一起守护美好生活！","1118","1398"),
(4,"toy","4.jpg","官方授权UniqueArt制作正版收藏级雕像初代御三家-小火龙已正式开启预售!","2388","2488"),
(5,"life","5.jpg","日本游戏周边公司HORI出品任天堂官方认证宝可梦Nintendo Switch周边商品新登场!","98","158"),
(6,"life","6.jpg","HORI出品 任天堂官方认证Joy-Con充电座与保护壳套组新登场!!亚洲地区先行发售!","249","299"),
(7,"life","7.jpg","就决定是它了！小米| 宝可梦 5款超萌产品，一次奉上！","699","799"),
(8,"life","8.jpg","青蛙儿童牙刷牙膏宝可梦授权系列产品全新上市，专业分龄，细致呵护","29","39"),
(9,"others","9.jpg","五和密胺餐具宝可梦授权系列","39","45"),
(10,"life","10.jpg","就决定是你了！Razer带来首款宝可梦授权外设！","299","399"),
(11,"clothes","11.jpg","adidas neo x Pokémon联名系列又来啦！","199","269"),
(12,"life","12.jpg","CHERRY  宝可梦正版授权系列定制键盘（MX 8.0/G80-3000）","1899","2199"),
(13,"others","13.jpg","好奇铂金装皮卡丘授权款纸尿裤解闷来袭！","159","199"),
(14,"food","14.jpg","味全乳酸菌宝可梦授权系列产品（原味/草莓/芦荟/低糖/西瓜/芒果）","6.5","9"),
(15,"life","15.jpg","APIYOO荷兰艾优皮卡丘声波电动牙刷正式上市","398","479"),
(16,"toy","16.jpg","12+积木品牌keepplay携6款超卡哇伊的宝可梦积木玩偶火热来袭","39","79");

CREATE TABLE products_details(
    did INT PRIMARY KEY AUTO_INCREMENT,
    small_img VARCHAR(100),
    big_img VARCHAR(100),
    magnify_img VARCHAR(100),
    title VARCHAR(100),
    details_img TEXT(1000)
);

INSERT INTO products_details(did,small_img,big_img,magnify_img,title,details_img) VALUES
(1,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","[宝可梦联名款皮卡丘]精臣D110家用标签打印机智能标签机可连手机姓名贴纸便签手持蓝牙热敏打印机便携式","details.jpg丨details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg丨details_6.jpg丨details_7.jpg丨details_8.jpg丨details_9.jpg丨details_10.jpg丨details_11.jpg丨details_12.jpg丨details_13.jpg丨details_14.jpg丨details_15.jpg丨details_16.jpg丨details_17.jpg丨details_18.jpg丨details_19.jpg"),
(2,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","TOMY多美卡宠物小精灵宝可梦聚会整蛊木桶桌游戏玩具皮卡丘869559","details.jpg丨details_1.jpg丨details_2.jpg丨details_3.jpg"),
(3,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg","三棵树BB漆宝可梦联名系列（悦享装/臻享装/尊享装/尊享mini装）","details.jpg丨details_1.jpg丨details_2.jpg丨details_3.jpg"),
(4,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","Unique Art 《宝可梦》授权雕像 小火龙","details.jpg丨details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg丨details_6.jpg丨details_7.jpg丨details_8.jpg丨details_9.jpg丨details_10.jpg"),
(5,"small_1.jpg丨small_2.jpg丨small_3.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg","宝可梦收纳包 for Nintendo Switch “Pikachu＆Friends” 和 “Stars”","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg丨details_6.jpg丨details_7.jpg丨details_8.jpg丨details_9.jpg丨details_10.jpg丨details_11.jpg丨details_12.jpg丨details_13.jpg丨details_14.jpg"),
(6,"small_1.jpg丨small_2.jpg丨small_3.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg","宝可梦Nintendo Switch Joy-Con充电座与保护壳套组","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg丨details_6.jpg丨details_7.jpg丨details_8.jpg"),
(7,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","【宝可梦联名】漫步者LolliPods皮卡丘真无线蓝牙耳机半入耳式适用于苹果安卓小米华为lollipops2021年新款","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg丨details_6.jpg丨details_7.jpg丨details_8.jpg丨details_9.jpg丨details_10.jpg丨details_11.jpg丨details_12.jpg丨details_13.jpg"),
(8,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg","青蛙儿童牙刷牙膏","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg"),
(9,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","宝可梦密胺餐具","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg"),
(10,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","宝可梦授权外设","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg"),
(11,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","adidas neo宝可梦联名款","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg"),
(12,"small_1.jpg丨small_2.jpg丨small_3.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg","CHERRY 键盘","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg丨details_6.jpg丨details_7.jpg"),
(13,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","好奇铂金装纸尿裤/成长裤","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg丨details_6.jpg丨details_7.jpg丨details_8.jpg丨details_9.jpg丨details_10.jpg"),
(14,"small_1.png丨small_2.png丨small_3.png丨small_4.png丨small_5.png","big_1.png丨big_2.png丨big_3.png丨big_4.png丨big_5.png","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","味全活性乳酸菌饮品","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg"),
(15,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","APIYOO荷兰艾优电动牙刷皮卡丘网红声波电动牙刷成人男女充电式","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg丨details_6.jpg丨details_7.jpg丨details_8.jpg丨details_9.jpg丨details_10.jpg丨details_11.jpg丨details_12.jpg丨details_13.jpg丨details_14.jpg丨details_15.jpg"),
(16,"small_1.jpg丨small_2.jpg丨small_3.jpg丨small_4.jpg丨small_5.jpg","big_1.jpg丨big_2.jpg丨big_3.jpg丨big_4.jpg丨big_5.jpg","magnify_1.jpg丨magnify_2.jpg丨magnify_3.jpg丨magnify_4.jpg丨magnify_5.jpg","keepplay宝可梦积木玩偶","details_1.jpg丨details_2.jpg丨details_3.jpg丨details_4.jpg丨details_5.jpg丨details_6.jpg丨details_7.jpg");


CREATE TABLE comments_1(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_2(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20),
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_3(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_4(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_5(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_6(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_7(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_8(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_9(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_10(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_11(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_12(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_13(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_14(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_15(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20), 
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
CREATE TABLE comments_16(
    cid INT PRIMARY KEY AUTO_INCREMENT,
    content VARCHAR(300) NOT NULL DEFAULT '好评',
    score INT DEFAULT 3,
    riqi VARCHAR(20),
    uname VARCHAR(10),
    avatar  VARCHAR(20)
);
